
#include "main.h"

#define LCDRS      0x20 /* PORT_OUT, выбор регистра данных/управления у ЖК */
#define LCD_CONTROL PORTA &= ~LCDRS /* Выбрать регистр упавления */
#define LCD_DATA    PORTA |= LCDRS  /* Выбрать регистр данных */
#define PORT_LCDKEY  PORTA   /* Порт индикатора LCD */

char flash symbol_work[] =  /* Символы для основной работы */
{
/* Код 0 - DAT_OFF */
//// 32, 14, 17, 17, 17, 14, 32, 32,
//32 , 32 , 4 , 15 , 31 , 15 , 4 , 32,
32 , 14 , 17 , 17 , 17 , 14 , 32 , 32,
   /*  ...??...  */
    /*  ...?.??.  */
    /*  ..??...?  */
    /*  ...?.??.  */
    /*  ...??...  *//* Код 1 - DAT_ON */
//// 32, 14, 31, 31, 31, 14, 32, 32,
//32 , 32 , 4 , 30 , 31 , 30 , 4 , 32,
32 , 14 , 31 , 31 , 31 , 14 , 32 , 32,

/* Код 2 - tube  */
32 , 32 , 31 , 31 , 31 , 31 , 31 , 32,

/* Код 3 - dat_1_off */
//14 , 17 , 17 , 14 , 32 , 4 , 4 , 4,
32 , 32 , 14 , 17 , 17 , 14 , 32 , 32,
/* Код 4 - dat_1_on */
//14 , 31 , 31 , 14 , 32 , 4 , 4 , 4,
32 , 32 , 14 , 31 , 31 , 14 , 32 , 32,
/* Код 5 - dat_2_off */
14 , 17 , 17 , 14 , 32 , 10 , 10 , 10,
/* Код 6 - dat_2_on */
//14 , 31 , 31 , 14 , 32 , 10 , 10 , 10,
0x04,0x0A,0x0A,0x0A,0x1F,0x04,0x00,0x00,
/* Код 7  Знак градусов цедьсия */
 0x06,
 0x09,
 0x09,
 0x06,
 0x00,  
 0x00,
 0x00,
 0x00
};

void LoadSymbol(void) /* Загрузить в индикатор дополнительные символы */
{
 int line;
 char disp_temp;

 LCD_CONTROL;           /* Выбрать регистр управления */
 PORT_LCDKEY = 0x04;    /* Установить адрес первого загружаемого символа  */
 LoadLcd();             /* Загрузить данные в LCD индикатор */
 PORT_LCDKEY = 0x00;    /* Записать данные в регистр индикатора/клавиатуры */
 LoadLcd();             /* Загрузить данные в LCD индикатор */
 delay_mks(240);
 for(line=0;line < 64;line ++)
 {
  disp_temp = symbol_work[line];
  LCD_DATA;                /* Выбрать регистр данных */
  PORT_LCDKEY &= 0xF0;     /* Обнулить младшую тетраду */
  PORT_LCDKEY |= disp_temp >> 4; /* Записать старшую тетраду в регистр индикатора/клавиатуры */
  LoadLcd();               /* Загрузить данные в LCD индикатор */
  PORT_LCDKEY &= 0xF0;     /* Обнулить младшую тетраду */
  PORT_LCDKEY |= disp_temp; /* Записать младшую тетраду в регистр индикатора/клавиатуры */
  LoadLcd();               /* Загрузить данные в LCD индикатор */
  delay_mks(240);
 }
 LCD_CONTROL;        /* Выбрать регистр управления */
 PORT_LCDKEY = 0x08; /* Установить адрес первого символа первой строки */
 LoadLcd();          /* Загрузить данные в LCD индикатор */
 PORT_LCDKEY = 0x00; /* Записать данные в регистр индикатора/клавиатуры */
 LoadLcd();          /* Загрузить данные в LCD индикатор */
 delay_mks(240);
}

