
#ifndef SpeedMetr__h
#define SpeedMetr__h

namespace nsSpeed
{
    //-------------------------------Переменные, флаги для скоростимера--------------------------------------------------------------------------------------
    extern unsigned int rezultat_skorosti;  // Результат скорости скорость об/мин 
    extern unsigned int Buf_impuls;         // Буфер для просмотра данных с счётчика импульсов
    extern unsigned int S;                  // Длинна окружности
    //---------------Переменные для фильтрации входного сигнала с индуктивного датчика-------------------------------------------
    // Отфильтрованное состояние датчика. Если 0-датчик вкл. Если 1-датчик выкл.
    // (при частоте прерывания 2КГц время фильтрации 10 мил.сек)
    extern unsigned char D_1;
    // -----------Speed Stan-----------------------------
    unsigned long SpeedStana();
    //----------Методы-------------------
    // for timer
    void timer();
    // init
    void init();
}

#endif

