
#include "timer.h"
#include "main.h"

//----------------------------------------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------------------------------
void Time_out_pirometr (void)
{  
if (Z2!=0)
   {Z2--;}
else {Z2=2000;Start_Data_RS485=1;}
}
void Zaderga_peredahi_RS (void)
{
 if (Z1!=0)
    {Z1--;}
 else {Z1=1000;Start_Data_RS=1;}
}

void timer_sys_pusk(void)//Инициализауия таймера/счётчика 0 (2 КГц)
{
 TCCR0 = 0x0c;  // Коэффициент деления 64 , очистка при совпадении
 TCNT0 = 0;     // Fx=Fs/( TCCR0 * ( 1+ OCR0 ) )
 OCR0 = 125;//2КГц //249=1КГц;
 TIMSK |= 1<<OCIE0; // Разрешить прерывания от Timer/Counter 0
}



void timer_sys(void)
{
    lcd_int();//Инициализация ЖКИ
    nsSpeed::timer();
    nsTok::timer();
/*
adc_pusk(0);// Запуск АЦП (в скобках номер канала=0)
usred ();//Чтение с АЦП  усреднённых данных
acp_date=adc_read();//Голые данные с АЦП
*/
Time_out_pirometr ();//Задержка перед запросом перометра
Zaderga_peredahi_RS();//Задержка для передачи в RS232 данных
}














// =========================================================
// =     обработка системного Timer 0  частота  2КГц       =
// =========================================================
#pragma vector = TIMER0_COMP_vect
__interrupt void tim0_interrupt(void)
{
  timer_sys();
}


